//функция хранения двумерного массива
//Входные данные: номер массива, integer
//Выходные данные: двумерный массив

function d_array(i){
    switch(i){
        case 0:
            mas = [[82, 67, 52],
                    [40, 11,83],
                    [65, 55, 76]];
            return mas;
        case 1:
            mas =
                [[92, 5, 85],
                [40,62,60]];
            return mas;
        case 2:
            mas =
                [[81, 47, 13],
                [16, 49, 80],
                [83, 47, 62],
                [38, 84, 42]];
            return mas;
        case 3:
            mas = 
                [[57, 76, 36, 75],
                [71, 32, 30, 42],
                [52, 26, 9, 44],
                [4,	15,	9,	49],
                [65, 25, 95, 87]];
            return mas;
        case 4:
            mas = 
                [[80, 22, 23],
                [83, 70, 13]];
            return mas;
        case 5:
            mas = 
                [[101,	82,	31,	28,	16],
                [38,	32,	97,	21,	30],
            [83,	87,	57,	29,	19],
            [12,	5,	49,	45,	75]];
            return mas;
        case 6:
            mas = 
                [[60,	2,	6,	12],
            [14,	50,	55,	90],
            [14,	23,	49,	11],
            [30,	90,	11,	95],
            [93,	45,	8,	6]];
            return mas;
        case 7:
            mas = 
            [[34,	35,	90,	81],
            [27,	25,	80,	90],
            [13,	58,	71,	77],
            [38,	14,	47,	57]];
            return mas;
        case 8:
            mas = 
            [[37,	82,	92,	89,	39],
            [17,	15,	25,	84,	66]];
            return mas;
        case 9:
            mas = 
            [[38,	75,	68],
            [14,	78,	50],
            [52,	80,	52]];
            return mas;
        }
}
